02_Mesh_and_CFD/case_setup/0/k
FoamFile{version 2.0;format ascii;class volScalarField;location "0";object k;}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.3;
boundaryField
{
 inlet  { type fixedValue; value uniform 0.3; }
 outlet { type zeroGradient; }
 top    { type zeroGradient; }
 bottom { type zeroGradient; }
 front  { type zeroGradient; }
 back   { type zeroGradient; }
 wing   { type kqRWallFunction; value uniform 0.0; }
}
