02_Mesh_and_CFD/case_setup/0/nut
FoamFile{version 2.0;format ascii;class volScalarField;location "0";object nut;}
dimensions [0 2 -1 0 0 0 0];
internalField uniform 1e-5;
boundaryField
{
 inlet  { type calculated; value uniform 1e-5; }
 outlet { type calculated; value uniform 1e-5; }
 top    { type calculated; value uniform 1e-5; }
 bottom { type calculated; value uniform 1e-5; }
 front  { type calculated; value uniform 1e-5; }
 back   { type calculated; value uniform 1e-5; }
 wing   { type nutkWallFunction; value uniform 0; }
}
