02_Mesh_and_CFD/case_setup/0/omega
FoamFile{version 2.0;format ascii;class volScalarField;location "0";object omega;}
dimensions [0 0 -1 0 0 0 0];
internalField uniform 300;
boundaryField
{
 inlet  { type fixedValue; value uniform 300; }
 outlet { type zeroGradient; }
 top    { type zeroGradient; }
 bottom { type zeroGradient; }
 front  { type zeroGradient; }
 back   { type zeroGradient; }
 wing   { type omegaWallFunction; value uniform 300; }
}
