02_Mesh_and_CFD/case_setup/constant/thermophysicalProperties
thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState incompressiblePerfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}
mixture
{
    specie          { nMoles 1; molWeight 28.9; }
    thermodynamics  { Cp 1005; Hf 0; }
    transport       { mu 1.8e-5; Pr 0.7; }
}
