02_Mesh_and_CFD/case_setup/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM                                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     off;
}

// ************************************************************************* //
