02_Mesh_and_CFD/case_setup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices (
 (-2 -2 -1) ( 6 -2 -1) ( 6  2 -1) (-2  2 -1)
 (-2 -2  1) ( 6 -2  1) ( 6  2  1) (-2  2  1)
);

blocks (
 hex (0 1 2 3 4 5 6 7) (40 20 16) simpleGrading (1 1 1)
);

edges ( );

boundary
(
 inlet  { type patch; faces ((0 4 7 3)); }
 outlet { type patch; faces ((1 2 6 5)); }
 top    { type patch; faces ((3 7 6 2)); }
 bottom { type patch; faces ((0 1 5 4)); }
 front  { type patch; faces ((0 3 2 1)); }
 back   { type patch; faces ((4 5 6 7)); }
);

mergePatchPairs ( );
