02_Mesh_and_CFD/case_setup/system/post.fo
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM                                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
  wingSurf
  {
    type                surfaces;
    libs                ("libsampling.so");
    enabled             true;

    interpolationScheme cellPoint;
    surfaceFormat       vtk;          // legacy ASCII .vtk
    fields              (p);

    surfaces
    (
      wingPatch
      {
        type        patch;
        patches     (wing);           // <-- your patch name
        triangulate true;
      }
    );
  }
}
// ************************************************************************* //
