02_Mesh_and_CFD/case_setup/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM                                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

wing.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {
        includedAngle   150;     // edge angle threshold
        geometricTest   yes;
        writeObj        yes;     // writes constant/triSurface/wing.eMesh
    }
    subsetFeatures
    {
        nonManifoldEdges   yes;
        openEdges          yes;
        sharpEdges         yes;
    }
}
// ************************************************************************* //
